In [126]:
# Import the necessary libraries
import numpy as np
import matplotlib.pyplot as plt
import pandas as pd
import seaborn as sns
from sklearn.preprocessing import StandardScaler, Normalizer

In [127]:
#load the data
data = pd.read_csv('autoscout24.csv', sep=';')

In [128]:
data.head()

,mileage,make,model,fuel,gear,offerType,price,hp,year of sale
0,235000,BMW,316,Diesel,Manual,Used,6800,116.0,2011
1,92800,Volkswagen,Golf,Gasoline,Manual,Used,6877,122.0,2011
2,149300,SEAT,Exeo,Gasoline,Manual,Used,6900,160.0,2011
3,96200,Renault,Megane,Gasoline,Manual,Used,6950,110.0,2011
4,156000,Peugeot,308,Gasoline,Manual,Used,6950,156.0,2011

In [129]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 46405 entries, 0 to 46404
Data columns (total 9 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   mileage       46405 non-null  int64
 1   make          46405 non-null  object
 2   model         46262 non-null  object
 3   fuel          46405 non-null  object
 4   gear          46223 non-null  object
 5   offerType     46405 non-null  object
 6   price         46405 non-null  int64
 7   hp            46376 non-null  float64
 8   year of sale  46405 non-null  int64
dtypes: float64(1), int64(3), object(5)
memory usage: 3.2+ MB

In [130]:
sum_of_all_null_values = data.isnull().sum()[data.isnull().sum() > 0].sum()
print(f'The database has {sum_of_all_null_values} null values')
print(f'This correspond to {sum_of_all_null_values/data.shape[0]*100:.2f}% of the data -> we can drop them for further analysis')

The database has 354 null values
This correspond to 0.76% of the data -> we can drop them for further analysis

In [131]:
#drup the null values
data = data.dropna()

In [132]:
data.describe()

            mileage         price            hp  year of sale
count  4.607100e+04  4.607100e+04  46071.000000  46071.000000
mean   7.123314e+04  1.656312e+04    132.992663   2016.012155
std    6.245413e+04  1.927960e+04     75.074689      3.155555
min    0.000000e+00  1.100000e+03      1.000000   2011.000000
25%    1.990000e+04  7.490000e+03     86.000000   2013.000000
50%    6.000000e+04  1.100000e+04    116.000000   2016.000000
75%    1.050000e+05  1.949000e+04    150.000000   2019.000000
max    1.111111e+06  1.199900e+06    850.000000   2021.000000

In [133]:
data.columns

Index(['mileage', 'make', 'model', 'fuel', 'gear', 'offerType', 'price', 'hp',
       'year of sale'],
      dtype='object')

In [134]:
dummy_data = pd.get_dummies(data=data,drop_first=True, columns=["make","model","fuel","gear","offerType"])

In [135]:
scaler = StandardScaler()
data_scaled = scaler.fit_transform(dummy_data[['mileage','hp','year of sale']])
data_scaled = pd.DataFrame(data_scaled, columns=['mileage','hp','year of sale'])

In [136]:
dummy_data.drop(columns=["mileage","hp","year of sale"],inplace=True)

In [137]:
#concatenate the scaled data with the rest of the data
data = pd.concat([data_scaled, dummy_data], axis=1)

In [138]:
data.head()

,mileage,hp,year of sale,price,make_Aixam,make_Alfa,make_Alpina,make_Alpine,make_Aston,make_Audi,...,fuel_Gasoline,fuel_Hydrogen,fuel_LPG,fuel_Others,gear_Manual,gear_Semi-automatic,offerType_Employee's car,offerType_New,offerType_Pre-registered,offerType_Used
0,2.622223,-0.226346,-1.588377,6800.0,False,False,False,False,False,False,...,False,False,False,False,True,False,False,False,False,True
1,0.345327,-0.146425,-1.588377,6877.0,False,False,False,False,False,False,...,True,False,False,False,True,False,False,False,False,True
2,1.250001,0.359743,-1.588377,6900.0,False,False,False,False,False,False,...,True,False,False,False,True,False,False,False,False,True
3,0.399768,-0.306267,-1.588377,6950.0,False,False,False,False,False,False,...,True,False,False,False,True,False,False,False,False,True
4,1.357281,0.306463,-1.588377,6950.0,False,False,False,False,False,False,...,True,False,False,False,True,False,False,False,False,True

In [141]:
data.describe()

            mileage            hp  year of sale         price
count  4.607100e+04  4.607100e+04  4.607100e+04  4.607100e+04
mean   1.184469e-16 -1.480587e-17 -2.193242e-14  1.656312e+04
std    1.000011e+00  1.000011e+00  1.000011e+00  1.927960e+04
min   -1.140580e+00 -1.758170e+00 -1.588377e+00  1.100000e+03
25%   -8.219423e-01 -6.259523e-01 -9.545668e-01  7.490000e+03
50%   -1.798641e-01 -2.263459e-01 -3.852028e-03  1.100000e+04
75%    5.406725e-01  2.265413e-01  9.468628e-01  1.949000e+04
max    1.665045e+01  9.550690e+00  1.580673e+00  1.199900e+06